In [1]:
datapath = "queuedatabase.db"
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect(datapath)
pd.read_sql_query("SELECT * FROM sqlite_master", cnx)["name"]
# pd.read_sql_query("SELECT * FROM simple_app_note",cnx)

0      shop
1    people
2      user
Name: name, dtype: object

In [2]:
pd.read_sql_query("SELECT * FROM people",cnx)

   id  shopid  number  capacity  waitingtime                  lastupdate
0   1      11       2  0.020000            0  2020-04-18 15:07:23.923730
1   2      11       7  0.031818            0  2020-04-18 15:07:45.077135
2   3      11       5  0.022727            0  2020-04-18 15:07:53.465816
3   4      11       3  0.013636            0  2020-04-18 15:08:00.300277
4   5      11      12  0.054545            0  2020-04-18 15:15:44.518182
5   6      11      17  0.077273            0  2020-04-18 15:15:53.141118
6   7      11      24  0.109091            0  2020-04-18 15:15:58.116758

In [3]:
pd.read_sql_query('SELECT * FROM shop',cnx)

,id,name,category,address,latitude,longitude,storespace,maxcapacity
0,1,Edeka,food,Munich,10.000000,10.000000,200,40
1,2,Edeka,food,Munich,10.000000,10.000000,200,40
2,3,Edeka,food,Munich,10.000000,10.000000,200,40
3,4,Edeka,food,Munich,10.000000,10.000000,200,40
4,5,Edeka,food,Munich,10.000000,10.000000,200,40
5,6,Edeka,food,Munich,10.000000,10.000000,200,40
6,7,Edeka,food,Munich,10.000000,10.000000,200,40
7,8,Edeka,food,Munich,10.000000,10.000000,200,40
8,9,Edeka,food,Munich,48.137108,11.575382,200,40
9,10,ALDI,groceries,munich,48.137108,11.575382,1000,200
10,11,REWE,groceries,"Tal 13, 80331 M端nchen",48.136242,11.579122,1200,220

In [4]:
pd.read_sql_query("SELECT * FROM user",cnx)

   id        name                        shopaddress           login  password
0   1       Edeka                             Munich        maxedeka       123
1   2  Max Muster  Lerchenauer Str. 3, 80809 M端nchen  muster@mail.de  12345678